[  
    {    
        "id": 1,    "chefPicture": "https://example.com/chef1.jpg",
        "chefName": "Farida Yasmin",
        "experience": 12,
        "numberOfRecipes": 35,
        "likes": 1024,
        "bio": "Farida Yasmin is a renowned chef from Dhaka, Bangladesh. She has been cooking Bangladeshi food for the past 12 years and has won numerous awards for her cooking. She loves to experiment with different ingredients and spices to create unique and flavorful dishes. In her free time, she enjoys gardening and spending time with her family."
    },
        
    {   
        "id": 2,
        "chefPicture": "https://example.com/chef2.jpg",
        "chefName": "Mohammed Rahman",
        "experience": 15,
        "numberOfRecipes": 42,
        "likes": 1536,
        "bio": "Mohammed Rahman is a passionate chef from Chittagong, Bangladesh. He has been cooking Bangladeshi food for the past 15 years and loves to share his recipes with others. He specializes in seafood dishes and is known for his signature spicy shrimp curry. In his free time, he enjoys fishing and exploring new ingredients."
        },
        
    {   
        "id": 3,
        "chefPicture": "https://example.com/chef3.jpg",
        "chefName": "Nazia Hossain",
        "experience": 10,
        "numberOfRecipes": 25,
        "likes": 512,
        "bio": "Nazia Hossain is a talented chef from Sylhet, Bangladesh. She has been cooking Bangladeshi food for the past 10 years and has a passion for creating healthy and nutritious dishes. She believes that food should not only taste good but also be good for you. In her free time, she enjoys hiking and exploring the outdoors."
    },

    {   
        "id": 4,
        "chefPicture": "https://example.com/chef4.jpg",
        "chefName": "Rasheda Begum",
        "experience": 8,
        "numberOfRecipes": 28,
        "likes": 512,
        "bio": "Rasheda Begum is a talented chef from Rajshahi, Bangladesh. She has been cooking Bangladeshi food for the past 8 years and specializes in vegetarian and vegan dishes. She believes that plant-based food can be just as flavorful and satisfying as meat-based dishes. In her free time, she enjoys practicing yoga and meditation."
    },
    
    {
        "id": 5,
        "chefPicture": "https://example.com/chef5.jpg",
        "chefName": "Abdul Karim",
        "experience": 20,
        "numberOfRecipes": 60,
        "likes": 2048,
        "bio": "Abdul Karim is a master chef from Khulna, Bangladesh. He has been cooking Bangladeshi food for the past 20 years and has won numerous awards for his cooking. He specializes in meat dishes and is known for his signature lamb curry. In his free time, he enjoys playing cricket and watching movies."
    },
    
    {
        "id": 6,
        "chefPicture": "https://example.com/chef6.jpg",
        "chefName": "Tasnim Ahmed",
        "experience": 5,
        "numberOfRecipes": 18,
        "likes": 256,
        "bio": "Tasnim Ahmed is a rising star in the world of Bangladeshi cuisine. She has been cooking for the past 5 years and is known for her creative and innovative dishes. She loves to experiment with different ingredients and spices to create unique and flavorful dishes. In her free time, she enjoys reading and listening to music."
    }
    
]
